### 프로젝트 개발 시작

# 라이브러리 선언

In [109]:
# 1. 라이브러리 선언
import pandas as pd
import numpy as np

# 데이터 불러오기

### DB 에서 데이터 불러오기

In [152]:
# 라이브러리 선언
from sqlalchemy import create_engine
from sqlalchemy import types 
# 엔진 설정 
engine = create_engine('oracle+cx_oracle://HKCJ:HKCJ@10.184.9.185:1521/xe')
# 데이터 불러 오기 
selloutData = pd.read_sql_query('SELECT * FROM CJ_CHANNEL_SEASONALITY', engine) 
# 데이터 살펴보기
selloutData.head()

  regionid    product yearweek      qty
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0
2      A60  PRODUCT34   201402   4463.0
3      A60  PRODUCT47   201402      0.0
4      A60  PRODUCT56   201402     23.0

##  region id 조인 --> region name 추출.

In [180]:
# 마스터 데이터 로딩 from 오라클 db
region_Mst = pd.read_sql_query('SELECT * FROM REGION_MASTER', engine)

In [181]:
region_Mst.dtypes

regionid      object
regionname    object
dtype: object

In [182]:
region_Mst.head()

  regionid regionname
0      A00     AFRICA
1      A01    AMERICA
2      A02      KOREA
3      A03     GERMAN
4      A04     BRAZIL

In [139]:
selloutData.head()

  regionid    product yearweek      qty
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0
2      A60  PRODUCT34   201402   4463.0
3      A60  PRODUCT47   201402      0.0
4      A60  PRODUCT56   201402     23.0

In [185]:
selloutData["regionname"] = pd.merge(selloutData, region_Mst, left_on = "regionid" , right_on = "regionid" ,
                          how ="left")[["regionname"]]

In [187]:
selloutData.head()

  regionid    product yearweek      qty regionname
0      A60   PRODUCT4   201402     71.0       THAI
1      A60  PRODUCT59   201402  22275.0       THAI
2      A60  PRODUCT34   201402   4463.0       THAI
3      A60  PRODUCT47   201402      0.0       THAI
4      A60  PRODUCT56   201402     23.0       THAI

mergeResult = pd.merge(selectExample, regionMasterData,\
        left_on="REGIONID", right_on = "REGIONID", how="left")\
[["REGIONID","REGIONNAME","PRODUCT","YEARWEEK","QTY"]]
mergeResult.head()

### 파일에서 데이터 불러 오기

In [59]:
# 2. 데이터 불러 오기
#selloutData = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")

#3-1. 데이터 살펴보기
#selloutData.head()

In [60]:
#3-2 데이터 타입 살펴보기
selloutData.dtypes

regionid     object
product      object
yearweek     object
qty         float64
dtype: object

# 데이터 정제 하기

### 1) 음수 데이터 정제 하기

In [188]:
#음수 데이터 삺펴보기
selloutData[(selloutData["qty"]<0)].head(5)

     regionid    product yearweek   qty regionname
65        A02  PRODUCT16   201403  -1.0     BRAZIL
338       A08  PRODUCT36   201402  -1.0        POL
1270      A14  PRODUCT36   201405  -1.0    BOLIVIA
1616      A17  PRODUCT60   201402  -1.0     CANADA
2035      A39   PRODUCT7   201404 -12.0       ARAB

In [189]:
#데이터 정제 하기
# 함수 정의
def refining(df):
    if df['qty'] < 0:
        return 0
    else:
        return df['qty']

# 음수 데이터 정제    
selloutData["qty_new"] = selloutData.apply(refining, axis=1)
selloutData.head()

  regionid    product yearweek      qty regionname  qty_new
0      A60   PRODUCT4   201402     71.0       THAI     71.0
1      A60  PRODUCT59   201402  22275.0       THAI  22275.0
2      A60  PRODUCT34   201402   4463.0       THAI   4463.0
3      A60  PRODUCT47   201402      0.0       THAI      0.0
4      A60  PRODUCT56   201402     23.0       THAI     23.0

In [190]:
# 음수 데이터 여부 확인 하기 
selloutData[(selloutData.qty_new < 0)]

Empty DataFrame
Columns: [regionid, product, yearweek, qty, regionname, qty_new]
Index: []

### 53주차 데이터 정제 하기

In [191]:
# 스트링 타입 변경 하기 
selloutData["yearweek"] = selloutData["yearweek"].astype(str)

# 53 주차 데이터 제외하고생성
selloutData_V2 = selloutData[(selloutData.yearweek.str[4:6] != "53")]

# 53 주체 데이터 존재 하는지 검증
selloutData_V2[(selloutData_V2.yearweek.str[4:6] == "53")]

Empty DataFrame
Columns: [regionid, product, yearweek, qty, regionname, qty_new]
Index: []

In [192]:
selloutData_V2.head()

  regionid    product yearweek      qty regionname  qty_new
0      A60   PRODUCT4   201402     71.0       THAI     71.0
1      A60  PRODUCT59   201402  22275.0       THAI  22275.0
2      A60  PRODUCT34   201402   4463.0       THAI   4463.0
3      A60  PRODUCT47   201402      0.0       THAI      0.0
4      A60  PRODUCT56   201402     23.0       THAI     23.0

## WEEK 데이터 분리 하기

In [193]:
#4-3 WEEK 데이터 분리 하기
selloutData_V2['week'] = selloutData_V2.yearweek.str[4:6]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

# 이동 평균/표준편차 데이터 만들기

In [194]:
#데이터 정렬
selloutData_V2.sort_values(["regionid","product","yearweek"], ascending=[True,True,True], inplace = True)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [195]:
#인덱스 초기화
selloutData_V2 = selloutData_V2.reset_index()
selloutData_V2.head()

   index regionid    product yearweek    qty regionname  qty_new week
0    298      A00  PRODUCT34   201401  661.0     MAXICO    661.0   01
1   1757      A00  PRODUCT34   201402  679.0     BEEGIE    679.0   02
2   3125      A00  PRODUCT34   201403  578.0       ARAB    578.0   03
3    205      A00  PRODUCT34   201404  532.0   COLOMBIA    532.0   04
4   4369      A00  PRODUCT34   201405  516.0    AMERICA    516.0   05

### 이동 평균 데이터 구하기

In [196]:
#그룹바이해서 롤링(이동평균) -
# 이동평균 함수 생성합
def sub_function(data):
    data["ma"] = data["qty_new"].rolling(window = 13, center = True, min_periods=1).mean()
    return data

# 그룹바이 + 이동 평균 생성
selloutData_V2 = selloutData_V2.groupby(["regionid","product"]).apply(sub_function)

In [197]:
selloutData_V2.head()

,index,regionid,product,yearweek,qty,regionname,qty_new,week,ma
0,298,A00,PRODUCT34,201401,661.0,MAXICO,661.0,01,542.285714
1,1757,A00,PRODUCT34,201402,679.0,BEEGIE,679.0,02,520.000000
2,3125,A00,PRODUCT34,201403,578.0,ARAB,578.0,03,514.444444
3,205,A00,PRODUCT34,201404,532.0,COLOMBIA,532.0,04,516.800000
4,4369,A00,PRODUCT34,201405,516.0,AMERICA,516.0,05,503.363636

## 표준편차 구하기

In [198]:
# 표준편차 함수 생성
def sub_function2(data):
    data["std"] = data["ma"].rolling(window = 5, center = True, min_periods=1).std()
    return data

selloutData_V2 = selloutData_V2.groupby(["regionid","product"]).apply(sub_function2)

In [199]:
selloutData_V2.head()

,index,regionid,product,yearweek,qty,regionname,qty_new,week,ma,std
0,298,A00,PRODUCT34,201401,661.0,MAXICO,661.0,01,542.285714,14.734617
1,1757,A00,PRODUCT34,201402,679.0,BEEGIE,679.0,02,520.000000,12.806131
2,3125,A00,PRODUCT34,201403,578.0,ARAB,578.0,03,514.444444,14.253036
3,205,A00,PRODUCT34,201404,532.0,COLOMBIA,532.0,04,516.800000,12.002994
4,4369,A00,PRODUCT34,201405,516.0,AMERICA,516.0,05,503.363636,15.591135

## 상/하한선 데이터 생성

In [200]:
# 상/하한선 작성
selloutData_V2["uppter_bound"] = selloutData_V2["ma"] + selloutData_V2["std"]
selloutData_V2["lower_bound"] = selloutData_V2["ma"] - selloutData_V2["std"]

selloutData_V2.head()

,index,regionid,product,yearweek,qty,regionname,qty_new,week,ma,std,uppter_bound,lower_bound
0,298,A00,PRODUCT34,201401,661.0,MAXICO,661.0,01,542.285714,14.734617,557.020331,527.551098
1,1757,A00,PRODUCT34,201402,679.0,BEEGIE,679.0,02,520.000000,12.806131,532.806131,507.193869
2,3125,A00,PRODUCT34,201403,578.0,ARAB,578.0,03,514.444444,14.253036,528.697481,500.191408
3,205,A00,PRODUCT34,201404,532.0,COLOMBIA,532.0,04,516.800000,12.002994,528.802994,504.797006
4,4369,A00,PRODUCT34,201405,516.0,AMERICA,516.0,05,503.363636,15.591135,518.954771,487.772501

### 정제된 판매량 산출

In [201]:
#정제된 판매량 산출
selloutData_V2["qty_refined"] = np.where(selloutData_V2["qty_new"]>selloutData_V2["uppter_bound"],selloutData_V2["uppter_bound"],
                                         np.where(selloutData_V2["qty_new"]<selloutData_V2["lower_bound"],selloutData_V2["lower_bound"],selloutData_V2["qty_new"]))

In [202]:
selloutData_V2.head()

,index,regionid,product,yearweek,qty,regionname,qty_new,week,ma,std,uppter_bound,lower_bound,qty_refined
0,298,A00,PRODUCT34,201401,661.0,MAXICO,661.0,01,542.285714,14.734617,557.020331,527.551098,557.020331
1,1757,A00,PRODUCT34,201402,679.0,BEEGIE,679.0,02,520.000000,12.806131,532.806131,507.193869,532.806131
2,3125,A00,PRODUCT34,201403,578.0,ARAB,578.0,03,514.444444,14.253036,528.697481,500.191408,528.697481
3,205,A00,PRODUCT34,201404,532.0,COLOMBIA,532.0,04,516.800000,12.002994,528.802994,504.797006,528.802994
4,4369,A00,PRODUCT34,201405,516.0,AMERICA,516.0,05,503.363636,15.591135,518.954771,487.772501,516.000000

## 스무딩 작성

In [203]:
#스무딩 작성 
def sub_function2(data):
    data["smoothing"] = data["qty_refined"].rolling(window = 5, center = True, min_periods=1).mean()
    return data

selloutData_V2 = selloutData_V2.groupby(["regionid","product"]).apply(sub_function2)

In [204]:
selloutData_V2.head(2)

,index,regionid,product,yearweek,qty,regionname,qty_new,week,ma,std,uppter_bound,lower_bound,qty_refined,smoothing
0,298,A00,PRODUCT34,201401,661.0,MAXICO,661.0,01,542.285714,14.734617,557.020331,527.551098,557.020331,539.507981
1,1757,A00,PRODUCT34,201402,679.0,BEEGIE,679.0,02,520.000000,12.806131,532.806131,507.193869,532.806131,536.831734

## 계절성 지수 산출

In [205]:
#계절성 지수 산정
#안정적
selloutData_V2["stable"] = selloutData_V2["qty_new"] / selloutData_V2["smoothing"]
#불안정
selloutData_V2["unstable"] = selloutData_V2["qty_refined"] / selloutData_V2["smoothing"]

In [206]:
selloutData_V2.head(10)

,index,regionid,product,yearweek,qty,regionname,qty_new,week,ma,std,uppter_bound,lower_bound,qty_refined,smoothing,stable,unstable
0,298,A00,PRODUCT34,201401,661.0,MAXICO,661.0,01,542.285714,14.734617,557.020331,527.551098,557.020331,539.507981,1.225190,1.032460
1,1757,A00,PRODUCT34,201402,679.0,BEEGIE,679.0,02,520.000000,12.806131,532.806131,507.193869,532.806131,536.831734,1.264828,0.992501
2,3125,A00,PRODUCT34,201403,578.0,ARAB,578.0,03,514.444444,14.253036,528.697481,500.191408,528.697481,532.665387,1.085109,0.992551
3,205,A00,PRODUCT34,201404,532.0,COLOMBIA,532.0,04,516.800000,12.002994,528.802994,504.797006,528.802994,514.586876,1.033839,1.027626
4,4369,A00,PRODUCT34,201405,516.0,AMERICA,516.0,05,503.363636,15.591135,518.954771,487.772501,516.000000,497.704610,1.036760,1.036760
5,4313,A00,PRODUCT34,201406,423.0,UK,423.0,06,490.750000,24.122226,514.872226,466.627774,466.627774,475.126508,0.890289,0.982113
6,6288,A00,PRODUCT34,201407,407.0,VANUAT,407.0,07,480.230769,31.835969,512.066738,448.394800,448.394800,462.229081,0.880516,0.970071
7,6403,A00,PRODUCT34,201408,364.0,CHILLE,364.0,08,453.384615,37.577643,490.962258,415.806973,415.806973,447.085420,0.814162,0.930039
8,5158,A00,PRODUCT34,201409,470.0,GERMAN,470.0,09,423.846154,40.469705,464.315859,383.376449,464.315859,427.559865,1.099261,1.085967
9,7437,A00,PRODUCT34,201410,538.0,COLOMBIA,538.0,10,401.230769,39.050923,440.281692,362.179847,440.281692,408.280905,1.317720,1.078379

## DB 에 결과값 저장 하기

### 오라클에 DB 저장 하기

In [207]:
#from sqlalchemy import create_engine
#from sqlalchemy import types

In [208]:
# DB 커넥션 열기
#engine = create_engine('oracle+cx_oracle://HKCJ:HKCJ@10.184.9.185:1521/xe')

In [209]:
# DB IMPORT
#resultname = 'sell_out_data_final'

# VARCHAR TYPE 변경
#to_varchar = {c:types.VARCHAR(selloutData_V2[c].str.len().max()) \
#        for c in selloutData_V2.columns[selloutData_V2.dtypes == 'object'].tolist()}

#selloutData_V2.to_sql(resultname, engine,index = False,  dtype=to_varchar)

### PROGRES DB 에 저장하기

In [210]:
import psycopg2
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine_postgres = create_engine('postgresql://postgres:admin@10.184.9.185:5432/postgres')  # pc 2
#engine_postgres = create_engine('postgresql://postgres:postgres@localhost:5432/postgres') # pc 1

In [211]:
# DB 에 데이터 저장 하기
resultname = 'sell_out_data_final'
selloutData_V2.columns = selloutData_V2.columns.str.lower()
# VARCHAR TYPE 변경
to_varchar = {c:types.VARCHAR(selloutData_V2[c].str.len().max()) \
        for c in selloutData_V2.columns[selloutData_V2.dtypes == 'object'].tolist()}
selloutData_V2.to_sql(resultname, engine_postgres, if_exists = 'replace', dtype=to_varchar)

In [212]:
# DB 테이블을 읽어 Data Frame 변수에 저장하기
test = pd.read_sql_query('SELECT * FROM sell_out_data_final', engine_postgres)

In [213]:
test.head()

,level_0,index,regionid,product,yearweek,qty,regionname,qty_new,week,ma,std,uppter_bound,lower_bound,qty_refined,smoothing,stable,unstable
0,0,298,A00,PRODUCT34,201401,661.0,MAXICO,661.0,01,542.285714,14.734617,557.020331,527.551098,557.020331,539.507981,1.225190,1.032460
1,1,1757,A00,PRODUCT34,201402,679.0,BEEGIE,679.0,02,520.000000,12.806131,532.806131,507.193869,532.806131,536.831734,1.264828,0.992501
2,2,3125,A00,PRODUCT34,201403,578.0,ARAB,578.0,03,514.444444,14.253036,528.697481,500.191408,528.697481,532.665387,1.085109,0.992551
3,3,205,A00,PRODUCT34,201404,532.0,COLOMBIA,532.0,04,516.800000,12.002994,528.802994,504.797006,528.802994,514.586876,1.033839,1.027626
4,4,4369,A00,PRODUCT34,201405,516.0,AMERICA,516.0,05,503.363636,15.591135,518.954771,487.772501,516.000000,497.704610,1.036760,1.036760